[
  {
    "ticker": "PGAS.JK",
    "nama_perusahaan": "PT Perusahaan Gas Negara Tbk",
    "sektor": "Utilities",
    "profil": "PT Perusahaan Gas Negara Tbk, together with its subsidiaries, engages in the transmission and distribution of natural gas in Indonesia. It operates through three segments: Gas Trading and Transmission, Exploration and Production of Oil and Gas, and Other Operations. The company is involved in the exploration, exploitation, and business development in oil and gas; and trading and transmission of gas, and processing of liquefied natural gas to industrial, commercial and household customers. It also provides fiber optic rental for network services; construction and maintenance services to the customers; management and leasing services of buildings and equipment; engineering and consultancy services; telecommunications; and electricity services. The company was founded in 1859 and is headquartered in Jakarta, Indonesia. PT Perusahaan Gas Negara Tbk operates as a subsidiary of PT Pertamina (Persero).",
    "tipe": "listed"
  },
  {
    "ticker": "MDKA.JK",
    "nama_perusahaan": "PT Merdeka Copper Gold Tbk",
    "sektor": "Basic Materials",
    "profil": "PT Merdeka Copper Gold Tbk engages in the mining business in Indonesia. It explores for gold, silver, copper, and other related minerals, as well as provides mining services. The company holds interests in the Tujuh Bukit Copper project; Pani Gold project; Tujuh Bukit Gold project; Merdeka Battery Materials project; and Wetar Copper project. It also offers metal manufacturing and trading services; mining and construction services; owns and leases real estate; business consulting and business broker services, as well as engages in other consulting management activities. The company was formerly known as PT Merdeka Sera and changed its name to PT Merdeka Copper Gold Tbk in December 2014. The company was founded in 2012 and is headquartered in Jakarta, Indonesia.",
    "tipe": "listed"
  },
  {
    "ticker": "BOLT.JK",
    "nama_perusahaan": "PT Garuda Metalindo Tbk",
    "sektor": "Industrials",
    "profil": "PT Garuda Metalindo Tbk manufactures and sells precision fasteners and engineered components primarily for the automotive industry in Indonesia, rest of Asia, Europe, and the Americas. The company offers bolts, nuts, screws, and rivets; and special components, and pins and collars for use in engine, suspension, brake, frame and chassis, interior, power train, and other applications. It serves the motorcycle, automobile, automotive components, electrical equipment, and home appliance industries. The company was founded in 1966 and is headquartered in Jakarta Utara, Indonesia. PT Garuda Metalindo Tbk is a subsidiary of PT Garuda Multi Investama.",
    "tipe": "IPO"
  },
  {
    "ticker": "ITMG.JK",
    "nama_perusahaan": "PT Indo Tambangraya Megah Tbk",
    "sektor": "Energy",
    "profil": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities in East, South, and Central Kalimantan. Its energy services include coal trading and mining contractor, as well as provides solar power plant services and solar energy through installing solar rooftops. The company is involved in fuel trading; energy marketing; electricity generation; and producing thermal coal. It primarily sells its coal in China, Japan, Philippines, India, Thailand, Hong Kong, Taiwan, Bangladesh, Korea, Malaysia, Vietnam, and Europe. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk operates as a subsidiary of Banpu Minerals (Singapore) Pte. Ltd.",
    "tipe": "listed"
  },
  {
    "ticker": "TINS.JK",
    "nama_perusahaan": "PT TIMAH Tbk",
    "sektor": "Basic Materials",
    "profil": "PT TIMAH Tbk engages in tin mining and smelting operations in Indonesia and internationally. It operates through Tin Mining, Industry, Construction, Coal Mining, and Other segments. The company offers Banka, Mentok, and Kundur tin, as well as tin solder and chemical products; and non-tin products, such as coal, nickel, and quartz sand. It is also involved in the provision of workshop, construction, shipping dockyard, real estate development, transportation, and marketing services. In addition, the company provides engineering and ship repair services, such as maritime vessel maintenance, shipbuilding, rental and purchase of maritime products, and other shipyard services. Further, it offers reclamation and agribusiness services, including agriculture, livestock, fisheries, trade essential oil industry, and agro-tourism services. The company was founded in 1976 and is headquartered in Bangka, Indonesia. PT TIMAH Tbk is a subsidiary of PT Mineral Industri Indonesia (Persero).",
    "tipe": "listed"
  },
  {
    "ticker": "BAYU.JK",
    "nama_perusahaan": "PT Bayu Buana Tbk",
    "sektor": "Consumer Cyclical",
    "profil": "PT Bayu Buana Tbk operates as a travel agent in Indonesia and internationally. The company provides travel reservations, travel tickets, and processes travel documents. It also provides tour guides, transport rentals, and accommodation reservations. In addition, the company engages in industrial development, travel bureau, transportation, and Umrah services, as well as engages in trading business. PT Bayu Buana Tbk acts as an airlines ticket sales agent; and organizes conventions, as well as offers transportation services. The company was founded in 1972 and is headquartered in Jakarta Pusat, Indonesia.",
    "tipe": "IPO"
  },
  {
    "ticker": "UNVR.JK",
    "nama_perusahaan": "PT Unilever Indonesia Tbk",
    "sektor": "Consumer Defensive",
    "profil": "PT Unilever Indonesia Tbk manufactures, markets, and distributes consumer goods in Indonesia. The company operates in two segments: Home and Personal Care; and Foods and Refreshment. It offers soaps, detergents, dairy based foods, ice creams, savories, soy sauce, cosmetic products, tea-based beverages, and fruit juices. The company provides its products under the Axe, Bango, Buavita, Cif, Citra, Clear, Clear Men, Close Up, Cornetto, Dove, Feast, Feast, Glow & Lovely, Hellmann's, Jawara, Knorr, Lifebuoy, Lipton, Love Beauty & Planet, Lux, Magnum, Molto, Paddle Pop, Pepsodent, Pond's, Pond's Men, Populaire, Rexona, Rinso, Royco, SariWangi, Seru, Simple, St. Ives, Suave, Sunlight, Sunsilk, Superpell, TRESemmé, The Vegetarian Butcher, Unilever Professional, Vaseline Men, Viennetta, Vixal, Wall's, Wipol, Zwitsalm, and other brands. It also leases office space. PT Unilever Indonesia Tbk was founded in 1933 and is headquartered in Tangerang, Indonesia. PT Unilever Indonesia Tbk (IDX:UNVR) operates as a subsidiary of Unilever Indonesia Holding B.V.",
    "tipe": "listed"
  },
  {
    "ticker": "SMGR.JK",
    "nama_perusahaan": "PT Semen Indonesia (Persero) Tbk",
    "sektor": "Basic Materials",
    "profil": "PT Semen Indonesia (Persero) Tbk manufactures, packs, and distributes cement in Indonesia and internationally. It operates through Cement Production and Non-Cement Production segments. The company is also involved in limestone and clay mining; cement bag manufacturing; industrial real estate development and building rental; ready-mix concrete and aggregates quarry production; and mining, trading, transportation, consulting, and construction activities. In addition, it engages in the information system, investment, freight forwarding, stevedoring, sea transportation, service logistic management, outsourcing, and building materials businesses, as well as procures public goods and services. The company was formerly known as PT Semen Gresik (Persero) Tbk and changed its name to PT Semen Indonesia (Persero) Tbk in January 2013. PT Semen Indonesia (Persero) Tbk was founded in 1953 and is headquartered in Jakarta Selatan, Indonesia.",
    "tipe": "listed"
  },
  {
    "ticker": "ELIT.JK",
    "nama_perusahaan": "PT Data Sinergitama Jaya Tbk",
    "sektor": "Technology",
    "profil": "PT Data Sinergitama Jaya Tbk provides IT infrastructure and managed services. The company's services include managed cloud, managed network, collocation, backup as a service, infrastructure as a service, and disaster recovery as a service. It serves the financial, retail, oil and gas, FMCG, and ecommerce sectors. The company was founded in 2011 and is headquartered in Jakarta, Indonesia.",
    "tipe": "IPO"
  },
  {
    "ticker": "FORE.JK",
    "nama_perusahaan": "PT Fore Kopi Indonesia Tbk",
    "sektor": "Consumer Cyclical",
    "profil": "PT Fore Kopi Indonesia Tbk develops and offers Fore Coffee platform that offers sources, roast, and develops espresso blend with Arabica beans. It also offers coffee, non-coffee, tea, refreshers, frappe, and merchandise. PT Fore Kopi Indonesia Tbk was founded in 2018 and is based in Central Jakarta, Indonesia. PT Fore Kopi Indonesia Tbk is a subsidiary of Fore Holdings Pte. Ltd.",
    "tipe": "IPO"
  },
  {
    "ticker": "BRPT.JK",
    "nama_perusahaan": "PT Barito Pacific Tbk",
    "sektor": "Basic Materials",
    "profil": "PT Barito Pacific Tbk, together with its subsidiaries, engages in the petrochemical production business. It operates through Petrochemical, Building and Hotel Management (Property), Energy and Resources, and Others segments. The company produces various palette of olefins, polyolefins, styrene monomer, and butadiene, including by-products. It also operates geothermal operations. In addition, the company manages properties; develops industrial and commercial property; and management consulting services. Further, it engages in the logistics and glue production businesses. The company was formerly known as PT Barito Pacific Timber Tbk and changed its name to PT Barito Pacific Tbk in 2007. PT Barito Pacific Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.",
    "tipe": "listed"
  },
  {
    "ticker": "BINA.JK",
    "nama_perusahaan": "PT Bank Ina Perdana Tbk",
    "sektor": "Financial Services",
    "profil": "PT Bank Ina Perdana Tbk provides banking products and services in Indonesia. The company operates through Marketing and Loans, Treasury, and Trade Finance segments. It offers savings, deposit, and current account; time deposit; certificate of deposit; productive, consumer, and cashless credit products; bancassurance; debit card; and trade finance, and internet and mobile banking services. It operates through a network of branches and supporting branches, as well as automatic teller machines. PT Bank Ina Perdana Tbk was founded in 1990 and is based in Jakarta Selatan, Indonesia.",
    "tipe": "IPO"
  },
  {
    "ticker": "WIFI.JK",
    "nama_perusahaan": "PT Solusi Sinergi Digital Tbk",
    "sektor": "Technology",
    "profil": "PT Solusi Sinergi Digital Tbk engages in the advertising businesses in Indonesia. It provides connectivity solutions, such as Dark fibre and bandwidth; and colocation data center, content delivery network, and tower fiberization services. The company also offers development technology ecosystems, including mobile applications, such as KAI access and DAMRI for ticketing services, Adakita, and Sobat Tani applications; advertising and media; and IT solutions. In addition, it engages in the wholesale and retail trade; professional, scientific, and technical activities; financial and insurance; and information and communication activities. The company was founded in 2012 and is based in Jakarta, Indonesia. PT Solusi Sinergi Digital Tbk is a subsidiary of PT Investasi Sukses Bersama.",
    "tipe": "IPO"
  },
  {
    "ticker": "EXCL.JK",
    "nama_perusahaan": "PT XLSMART Telecom Sejahtera Tbk",
    "sektor": "Communication Services",
    "profil": "PT XLSMART Telecom Sejahtera Tbk, together with its subsidiaries, provides telecommunication, telecommunications network, and multimedia services for consumers and businesses in Indonesia. It operates through two segments GSM mobile and telecommunications network and information technology services. The company provides cellular mobile and closed fixed network, Internet, Internet telephony and interconnection, data communication system, packet switched local fixed network, telephony, and voice over Internet protocol services. It also offers digital content and home broadband services; voice and short message services; data and digital; mobile communication and telecommunication services; and other telecommunication services, includes SIM card sales, leased line, and tower. PT XLSMART Telecom Sejahtera Tbk was formerly known as PT XL Axiata Tbk and changed its name to PT XLSMART Telecom Sejahtera Tbk in April 2025. The company was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia.",
    "tipe": "IPO"
  },
  {
    "ticker": "JPFA.JK",
    "nama_perusahaan": "PT Japfa Comfeed Indonesia Tbk",
    "sektor": "Consumer Defensive",
    "profil": "PT Japfa Comfeed Indonesia Tbk operates as an agri-food company in Indonesia. The company operates through six segments: Animal Feed, Poultry Breeding, Commercial Farm, Poultry Processing and Consumer Products, Aquaculture, and Trading and Others. It provides poultry services comprising chicken livestock business, which includes poultry feed, breeding, and processing; commercial farming; broiler production; processed animal protein, as well as animal health and livestock equipment; and farm supplies. The company also engages in aquaculture services, which include aqua feed, fish and shrimp hatchery, and technical support services; and engages in beef business, including beef cattle breeding, fattening, slaughterhouses, and value-added meat production. In addition, its trading business include wholesale of other food and beverages, live animals, oils and vegetable fats, and rubber and plastics; and retail of livestock and aquaculture, as well as animal/poultry/fish, and pets' feed. Further, it offers raw materials, such as beef, chicken, and seafood; and value-added chicken, beef, and sea foods. Additionally, it is involved in the real estate; plantation and framing; transportation; and investment activities; wholesale of pharmaceuticals; and provides agricultural machinery and equipment supplies, veterinary pharmaceutical products, and logistics and freight forwarding services. The company markets its products in Asia, Europe, and the United States. The company was founded in 1971 and is headquartered in Jakarta, Indonesia. PT Japfa Comfeed Indonesia Tbk is a subsidiary of Japfa Ltd.",
    "tipe": "listed"
  },
  {
    "ticker": "ISAT.JK",
    "nama_perusahaan": "PT Indosat Ooredoo Hutchison Tbk",
    "sektor": "Communication Services",
    "profil": "PT Indosat Ooredoo Hutchison Tbk, together with its subsidiaries, provides digital telecommunication services in Indonesia. It operates through Cellular; MIDI; and Fixed Telecommunications segments. The company offers prepaid and post-paid services, and international and roaming, such as outbound roamers, international call and SMS, and overseas call products. It also provides data communication and IT services; information and telecommunication; and electronic payment and remittance services. The company offers services under the Ooredoo brand name. The company was founded in 1967 and is headquartered in Jakarta, Indonesia. PT Indosat Ooredoo Hutchison Tbk operates as a subsidiary of Ooredoo Hutchison Asia Pte. Ltd.",
    "tipe": "IPO"
  },
  {
    "ticker": "DATA.JK",
    "nama_perusahaan": "Unknown",
    "sektor": "Communication Services",
    "profil": "PT Remala Abadi Tbk operates as an internet service provider in Indonesia. It provides broadband internet, local link services, and server colocation services; connectivity/installation and multimedia services; and managed services for IP CAM setup, VOIP, and WiFi device. The company also offers cloud services, virtual private networks, IoT, CCTV, IP domain, IP public, email solutions, etc. In addition, it engages in computer trading and programming activities. It serves SPs as partners, corporations, SMEs, SOHOs, government, and residential sectors. The company was founded in 2004 and is headquartered in Jakarta, Indonesia.",
    "tipe": "IPO"
  },
  {
    "ticker": "GGRM.JK",
    "nama_perusahaan": "PT Gudang Garam Tbk",
    "sektor": "Consumer Defensive",
    "profil": "PT Gudang Garam Tbk, together with its subsidiaries, engages in the manufacture and sale of cigarettes in Indonesia and internationally. The company operates through Cigarettes, Paperboards, Infrastructure, and Others segments. It offers hand-rolled, machine-made, and klobot clove cigarettes. The company markets its products under the Gudang Garam Family, Surya Family, and GG Family brand names. It is also involved in trading business; and provision of safety protective equipment, and investment and construction services. In addition, the company provides tobacco processing, non-scheduled air transportation, infrastructure, entertainment, and tourism services. The company was formerly known as PT Perusahaan Rokok Tjap Gudang Garam Kediri. PT Gudang Garam Tbk was founded in 1958 and is headquartered in Kediri, Indonesia. PT Gudang Garam Tbk is a subsidiary of PT Suryaduta Investama.",
    "tipe": "listed"
  },
  {
    "ticker": "VKTR.JK",
    "nama_perusahaan": "PT VKTR Teknologi Mobilitas Tbk",
    "sektor": "Consumer Cyclical",
    "profil": "PT VKTR Teknologi Mobilitas Tbk engages in manufacturing and trading of automotive and metal components. It offers electric buses and motors, charging stations, and telematics and smart fleet management. The company also trades battery-based electric vehicles; and provides foundry and automotive components, as well as vehicle body. In addition, it engages in wholesale and leasing of automotive and components. The company was founded in 2007 and is based in Jakarta, Indonesia. The company is a subsidiary of PT Bakrie & Brothers Tbk.",
    "tipe": "IPO"
  },
  {
    "ticker": "BMRI.JK",
    "nama_perusahaan": "PT Bank Mandiri (Persero) Tbk",
    "sektor": "Financial Services",
    "profil": "PT Bank Mandiri (Persero) Tbk provides various banking products and services to individuals and businesses in Indonesia, Singapore, Hong Kong, Timor Leste, Shanghai, Malaysia, England, and the Cayman Islands. It offers savings and current accounts, multicurrency, payroll, NOW, and foreign currency savings accounts; personal, mortgage, micro enterprise, small and medium enterprises, working capital, and investment loans; corporate, credit, and debit cards; digital banking; and e-banking services. The company also provides life, health, and accident insurance products, as well as investment products; cash management, bill collection, payment, trade finance, money transfer, remittance, and wealth management services; and treasury services, including cash transaction, hedging, and investment products. It operates branch offices, sub-branch offices, and overseas branch offices; and ATM facilities. The company was founded in 1998 and is headquartered in Jakarta, Indonesia.",
    "tipe": "listed"
  },
  {
    "ticker": "BBCA.JK",
    "nama_perusahaan": "PT Bank Central Asia Tbk",
    "sektor": "Financial Services",
    "profil": "PT Bank Central Asia Tbk, together with its subsidiaries, provides banking products and other financial services to individual, corporate, and small and medium enterprise customers in Indonesia and internationally. It operates through Transaction Banking, Corporate Banking, Commercial & Small & Medium Enterprise SME Banking, Individual Banking, and Treasury and International Banking segments. The company offers various products and services, such as individual and business saving, deposit, loan, and electronic money accounts; wealth management services; credit cards; and business collection and investment services. It also provides transaction banking and cash management, electronic banking, and bancassurance services; mutual fund investment products; credit and export import facilities; foreign exchange facilities; and bank guarantees. In addition, the company offers international banking services, such as cross-border remittances, trade finance, and specialized solutions for banks and financial institutions. Further, it offers money lending and remittance, auto financing and multipurpose financing, securities brokerage dealing and securities issuance underwriting, general and life insurance, Sharia banking, and venture capital services. PT Bank Central Asia Tbk was founded in 1955 and is headquartered in Jakarta, Indonesia. PT Bank Central Asia Tbk is a subsidiary of PT Dwimuria Investama Andalan.",
    "tipe": "listed"
  },
  {
    "ticker": "TLKM.JK",
    "nama_perusahaan": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk",
    "sektor": "Communication Services",
    "profil": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk provides information and communications technology, and telecommunications network services worldwide. The company operates through Mobile, Consumer, Enterprise, Wholesale and International Business, and Other segments. The Mobile segment offers mobile voice, SMS, mobile broadband, and value added services. The Consumer segment provides fixed wireline, pay TV, and internet services; and other telecommunication services to home customers. The Enterprise segment offers end-to-end solution to corporate and institutions. The Wholesale and International Business segment provides interconnection services, broadband access, information technology services, data, and internet services to other licensed operator and institutions. The Other segment offers digital content products, big data, business-to-business commerce, and financial services to individual and corporate customers. The company also engages in leasing of towers, and provision of digital support and other telecommunication services; provision of consultation service of hardware, software, data center, and internet exchange, as well as multimedia portal services; business management consulting; property development and management; trading service related to telecommunication, information, multimedia technology, entertainment, and investment services; and digital content exchange hub services. The company was founded in 1884 and is headquartered in Bandung, Indonesia. Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk operates as a subsidiary of Pt. Biro Klasifikasi Indonesia (Persero).",
    "tipe": "listed"
  },
  {
    "ticker": "PTBA.JK",
    "nama_perusahaan": "PT Bukit Asam Tbk",
    "sektor": "Energy",
    "profil": "PT Bukit Asam Tbk, together with its subsidiaries, engages in coal mining activities in Indonesia. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It maintains special coal port facilities; operates steam power plants; and engages in the mining of coal methane gas. The company also offers briquette processing, mining services, palm plantation and processing, and health services, as well as real estate and construction services. In addition, it engages in the hospital clinic and polyclinic; rental; port; and trade, services, workshop, development, industry, and transportation businesses. It also operates in India, South Korea, China, Japan, Italy, Thailand, Cambodia, Taiwan, Malaysia, the Philippines, Vietnam, and Hong Kong. The company was formerly known as PT Bukit Asam (Persero) Tbk and was changed to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1876 and is based in Tanjung Enim Selatan, Indonesia. PT Bukit Asam Tbk operates as a subsidiary of PT Mineral Industri Indonesia (Persero).",
    "tipe": "listed"
  },
  {
    "ticker": "ASII.JK",
    "nama_perusahaan": "PT Astra International Tbk",
    "sektor": "Industrials",
    "profil": "PT Astra International Tbk, together with its subsidiaries, operates in the automotive, financial services, heavy equipment, mining, construction, energy, agri, infrastructure and logistics, information technology, and property businesses in Indonesia and internationally. It operates in Automotive, Financial Services, Heavy Equipment and Mining, construction, and energy, infrastructure and logistics, Agribusiness, Information Technology, and Property segments. The Automotive segment includes car, motorcycle, component, and others. Its Financial Services segment engages in car, motorcycle, heavy equipment financing, and Insurance. The Heavy Equipment and Mining, construction, and energy segment engages in construction machines, mining contractor, mining, and construction. Its infrastructure and logistics segment includes infrastructure and logistics value chain services; Agribusiness segment include oil palm plantations and their derivative products. The Information Technology segment comprises document solutions, IT Solutions, and office solutions; and Property development segment. The company also engages in sales of spare parts, heavy equipment and rental services, mining and related services. The company was founded in 1957 and is headquartered in Jakarta, Indonesia. PT Astra International Tbk operates as a subsidiary of Jardine Cycle & Carriage Limited.",
    "tipe": "listed"
  },
  {
    "ticker": "HMSP.JK",
    "nama_perusahaan": "PT Hanjaya Mandala Sampoerna Tbk",
    "sektor": "Consumer Defensive",
    "profil": "PT Hanjaya Mandala Sampoerna Tbk, together with its subsidiaries, engages in manufacture, distribution, and trading of cigarettes and other tobacco products in Indonesia. The company offers hand-rolled kretek and machine-made kretek cigarettes under the Dji Sam Soe Magnum, Sampoerna Kretek, Sampoerna A, and Marlboro Filter Black brand names. It also engages in the general trading; e-commerce and agency; provision of leisure and golf course services; and property development. PT Hanjaya Mandala Sampoerna Tbk was founded in 1913 and is headquartered in Surabaya, Indonesia. PT Hanjaya Mandala Sampoerna Tbk ioperates as a subsidiary of PT Philip Morris Indonesia.",
    "tipe": "listed"
  }
]